{
  "receitas": [
    {
      "id": 1,
      "foto": "bruaca",
      "titulo": "Bruaca cearense",
      "resumo": "Receita de bruaca, uma panquequinha nordestina muito fácil de fazer para servir no café da manhã ou no lanche e encantar a família! Confira agora mesmo!",
      "igredientes": [
        "1 ovo",
        "1 colher de sopa de manteiga",
        "1/2 xícara (chá) de açúcar",
        "1/2 xícara (chá) de farinha de trigo",
        "1 xícara (chá) de leite",
        "1 pitada de sal",
        "óleo ou manteiga para untar"
      ],
      "preparo":
        [
          "Misture bem os ingredientes até formar uma massa pastosa.",
          "Faça um bolinho de massa e cubra com manteiga ou óleo untado.",
          "Em frigideira antiaderente untada com óleo ou manteiga, espalhe porções da massa, formando círculos de 10 a 12 cm de diâmetro.",
          "Deixe dourar por baixo e vire para dourar do outro lado.",
          "Sirva com mel, frutas, geleia, creme de avelã etc."
        ],
      "vegano": true,
      "tipo": "Doces",
      "culinária": ["Cearense"],
      "tempoDePreparo": "10 minutos",
      "rendimento": "2 porções",
      "acessos": 5,
      "destaque": true
    },
    {
      "id": 2,
      "foto": "pasta-g6a3a00a95_1920",
      "titulo": "Macarrão Carbonara",
      "resumo": "Receita de Macarrão Carbonara tradicional e deliciosa, feita com bacon, macarrão inegral muito queijo.",
      "igredientes": [
        "150 g de bacon em tiras finas de 1 cm",
        "400 g de macarrão integral",
        "6 gemas de ovo",
        "100 g queijo parmesão fresco ralado",
        "1 pitada de pimenta do reino moída (eu gosto com bastante pimenta)"
      ],
      "preparo": [
        "Em uma frigideira de bordas altas, em fogo médio, frite as tiras de bacon dos dois lados, tomando cuidado para não queimar.Reserve.",
        "Em uma frigideira, coloque o bacon, o Spaghetti e o queijo ralado.",
        "Em outra panela, ferva 3 litros de água e coloque o macarrão para cozinhar (não é necessário adicionar sal ou óleo).",
        "Cozinhe-o por cerca de 9 minutos, até ficar “al dente”.",
        "Retire do fogo e reserve.",
        "Enquanto o macarrão cozinha, despeje as gemas em uma tigela, uma parte do queijo parmesão e a pimenta, misturando tudo com um batedor de arame.",
        "Adicione duas colheres de sopa da água do cozimento do macarrão para ficar bem cremoso.",
        "Quando o macarrão estiver “al dente”, escorra-o, aqueça a frigideira com o bacon em fogo baixo e adicione a massa, misturando bem e rapidamente.",
        "Tire a frigideira do fogo e junte a mistura de gema e queijo, incorporando-a vigorosamente.",
        "Sirva imediatamente com o restante do queijo ralado por cima."
      ],
      "vegano": false,
      "tipo": "Massas",
      "culinária": ["Italiana"],
      "tempoDePreparo": "30 minutos",
      "rendimento": "5 porções",
      "acessos": 2,
      "destaque": false
    },
    {
      "id": 3,
      "foto": "caponata",
      "titulo": "Caponata de beringela",
      "resumo": "Receita de Caponata de Berinjela deliciosa feita com pimentão amarelo, verde e vermelho, berinjela e champignon .",
      "igredientes": [
                      "2 berinjelas grandes em cubos",
                      "1 pimentão amarelo em cubos",
                      "1 pimentão vermelho em cubos",
                       "1 cebola grande, em cubos",
                       "1/2 xícara (chá) de azeitonas sem caroço, cortadas ao meio",
                       "Sal a gosto","Orégano a gosto","200g de champignon cortado",
                       "Azeite para refogar e para cobrir a conserva",
                       "Salsinha e cebolinha a gosto"],
      "preparo": [
                  "Descasque as berinjelas e corte-as em cubinhos ou tirinhas.",
                  "Tire as sementes dos pimentões e corte-os em cubinhos ou tirinhas.",
                  "Em uma panela, refogue a cebola picadinha junto com o alho amassado e o orégano no azeite.",
                  "Junte a berinjela e os pimentões.",
                  "Mexa para não pegar no fundo.",
                  "Acrescente as azeitonas e o champignon.",
                  "Prove e acerte o sal se necessário.",
                  "Depois que a berinjela estiver bem molinha, apague o fogo e acrescente a salsinha e a cebolinha.",
                  "Coloque em um refratário de vidro e deixe esfriar.",
                  "Esterelize um pote de vidro (com tampa) jogando água fervente dentro dele.",
                  "Depois que esfriar, coloque a caponata no pote de vidro, cubra com azeite, tampe e leve à geladeira.",
                  "Depois que estiver gelada já pode consumir, porém ela fica mais gostosa no dia seguinte.",
                  "Ideal para servir como aperitivo com torradinhas ou pão italiano."
                ],
      "vegano": true,
      "tipo": "Acompanhamentos",
      "culinária": ["Italiana"],
      "tempoDePreparo": "40 minutos",
      "rendimento": "10 porções",
      "acessos": 0,
      "destaque": false
    },
    {
      "id": 4,
      "foto": "costela-barbecue",
      "titulo": "Costelinha suina ao molho barbecue",
      "resumo": "A receita daquela costelinha macia feita no forno",
      "igredientes": [
                      "700g de costelinha suína",
                      "Molho barbecue",
                      "Sal a gosto",
                       "Papel aluminio para cobrir"
      ],
      "preparo": [
                  "Corte no meio para distruibuir bem na assadeira",
                  "Salgue bem, eu gosto com muito sal.",
                  "Coloque na panela de pressão por 7 minutos quando pegar pressão, com água suficiente para cobrir.",
                  "Vá ligando o forno em 200°.",
                  "Retire a carne e coloque na assadeira",
                  "Cubra com papel alumínio e deixe assar por 40 minutos",
                  "Retire o papel alumínio e volte para o forno a assadeira por mais 10 minutos",
                  "Passe bastante molho e cobre novamente com papel alumínio. Leve ao forno por mas 10 minutos",
                  "Tire o papel alumínio e passe mais molho. Leve ao forno por mais 10 minutos",
                  "Passe mais molho, cubra com papel e deixe no forno por mais 10 minutos"
                ],
      "vegano": false,
      "tipo": "Carnes suína",
      "culinária": ["Brasileira"],
      "tempoDePreparo": "90 minutos",
      "rendimento": "8 porções",
      "acessos": 4,
      "destaque": true
    },
    {
      "id": 5,
      "foto": "torta-frango",
      "titulo": "Torta de frango",
      "resumo": "Uma deliciosa torta de frango na massa de empada super fácil de fazer.",
      "igredientes": [
                      "800g de peito de frango",
                      "1 copo de requeijão",
                      "1 molho de tomate",
                      "1 caixa de creme de leite",
                      "Sal e oregano",
                      "3/4 de um pacote de farinha de trigo",
                      "Leite para dar o ponto",
                      "2 colheres cheias de manteiga",
                      "1 colher de fermento em pó"
      ],
      "preparo": [
                  "Cozinhe o peito de frango e disfie, eu prefiro fazer isso na panela de pressão.",
                  "Em seguida adicione um pouco da água de cozimento, o sal, o oregano e o moho de tomate. Deixe a água secar, o frango deve ficar cremoso.",
                  "Ao desligar o fogo acrescente o creme de leite e reserve.",
                  "Para a massa junte a farinha de trigo, os ovos, a manteiga, o sal, o creme de leite e o fermento em um recipiente e sove ate a massa ficar fofa e amarelinha.",
                  "Junte aos poucos o leite para deixar a massa homogênea.",
                  "Divida a massa em duas partes, a primeira parte vai cobrir a assadeira e a segunda será usada para 'fechar' a torta.",
                  "Abra a primeira parte na assadeira e coloque o frango.",
                  "Em seguida adicione várias colheres de requeijão bem distribuídas.",
                  "Feche a torta com a segunda parte da massa.",
                  "Utilize uma gema de ovo para pincelar sobre a torta.",
                  "Leve ao forno por aproximadamente 50 minutos"
                ],
      "vegano": false,
      "tipo": "Aves",
      "culinária": ["Brasileira"],
      "tempoDePreparo": "90 minutos",
      "rendimento": "12 porções",
      "acessos": 2,
      "destaque": false
    },
    {
      "id": 6,
      "foto": "bolo-indiano",
      "titulo": "Bolo indiano",
      "resumo": "Uma ótima receita para aquele café da tarde. Um bolo de farinha de rosca diferente de qualquer bolo que você já provou.",
      "igredientes": [
                      "8 ovos",
                      "100g de manteiga sem sal",
                      "1 xícara e 1/2 de chá de açúcar",
                      "2 xícaras de chá de farinha de rosca",
                      "1 colher de sopa de canela",
                      "1 colher de sopa de fermento químico",
                      "Açucar de confeiteiro com canela para peneirar",
                      "1 lata de leite condensado",
                      "1 colher de sopa de manteiga"
      ],
      "preparo": [
                  "Bata as claras em neve e reserve.",
                  "Na batedeira, bata a margarina com o açúcar e 6 gemas até virar um creme.",
                  "Sem bater, misture a farinha de rosca, a canela e o fermento.",
                  "Delicadamente, incorpore a clara em neve.",
                  "Despeje em fôrma retangular untada e enfarinhada.",
                  "Leve ao forno médio preaquecido (180 ºC) por cerca de 40 minutos ou até dourar.",
                  "Desenforme morno e deixe esfriar.",
                  "Em seguida para o recheio adicione as 2 gemas que sobraram com o leite condensado e a colher de manteiga.",
                  "Misture ate engrossar.",
                  "Jogue por cima do bolo, eu uso uma forma com um furo no meio e deixo um bolo vulcão.",
                  "Jogue o açúcar com canela por cima."
                ],
      "vegano": false,
      "tipo": "Doces",
      "culinária": ["Indiana"],
      "tempoDePreparo": "90 minutos",
      "rendimento": "10 porções",
      "acessos": 10,
      "destaque": true
    },
    {
      "id": 7,
      "foto": "macarrão-amatriciana",
      "titulo": "Macarrão Alla Matriciana",
      "resumo": "Uma massa de rapido preparo e muito saborosa. E o mais importante: muito bacon.",
      "igredientes": [
                      "300 g de macarrão",
                      "200 g de bacon",
                      "4 tomates grandes e maduros",
                      "1/2 taça de vinho branco seco",
                      "1 colher de sopa de azeite",
                      "1 colher de sopa de fermento químico",
                      "2 colheres de sopa de massa de tomate",
                      "Sal, pimenta e ervas a gosto"
      ],
      "preparo": [
                  "Tire a pele dos tomates corte - os em cubos.",
                  "Em uma panela coloque os tomates e tempere com sal e pimenta.",
                  "Depois de macios, acrescente o purê de tomates, o vinho e, se necessário, um pouquinho de água.",
                  "Espere 5 minutos até o álcool do vinho evaporar.",
                  "Em outra panela, doure o bacon com a colher de azeite.",
                  "Retire o excesso de gordura, e junte ao molho já encorpado.",
                  "Acrescente as ervas secas.",
                  "Adicione ao macarrão ao dente",
                  "Decore com queijo parmesão ralado e um pouco de majericão."
                ],
      "vegano": false,
      "tipo": "Massas",
      "culinária": ["Italiana"],
      "tempoDePreparo": "30 minutos",
      "rendimento": "3 porções",
      "acessos": 10,
      "destaque": true
    },
    {
      "id": 8,
      "foto": "bolo-prestigio",
      "titulo": "Bolo prestígio",
      "resumo": "Inspirado pelo chocolade de coco famoso, esse bolo é uma bomba de açúcar.",
      "igredientes": [
                      "3 ovos",
                      "1/2 xícara (chá) de óleo",
                      "1 xícara (chá) de leite",
                      "1 xícara (chá) de leite",
                      "1 xícara (chá) de chocolate em pó",
                      "2 xícaras (chá) de farinha de trigo",
                      "1 colher (sopa) de fermento",
                      "coco ralado a gosto",
                      "CALDA",
                      "1 garrafa de leite de coco",
                      "1 xícara (chá) de leite",
                      "3 colheres (sopa) de açúcar",
                      "RECHEIO",
                      "1 lata de leite condensado",
                      "1 colher (sopa) de margarina",
                      "100 g de coco ralado",
                      "COBERTURA",
                      "3 colheres (sopa) de margarina",
                      "8 colheres (sopa) de açúcar",
                      "2 colheres (sopa) de chocolate em pó",
                      "2 xícaras (chá) de leite"
      ],
      "preparo": [
                  "BOLO",
                  "Bata no liquidificador, os ovos, o óleo e o leite por 3 minutos e reserve.",
                  "Em um recipiente, misture o açúcar, o trigo, o fermento, o chocolate e o coco ralado a gosto.",
                  "Despeje sobre a mistura do liquidificador e mexa até que a massa fique consistente.",
                  "Despeje a massa em uma forma untada e leve ao forno médio, preaquecido, por 30 minutos ou até que ao enfiar um garfo, este saia limpo.",
                  "Deixe esfriar, corte ao meio e reserve.",
                  "CALDA",
                  "Deixe esfriar, corte ao meio e reserve.",
                  "RECHEIO",
                  "Em uma panela, leve o leite condensado, a margarina e o coco ralado ao fogo até desgrudar do fundo e recheie o bolo.",
                  "Cubra com a outra metade da massa, faça alguns furos com o garfo e despeje mais calda.",
                  "COBERTURA",
                  "Leve a margarina, o açúcar, o chocolate em pó e o leite ao fogo até obter uma consistência firme e cubra o bolo.",
                  "Leve a geladeira por aproximadamente 45 minutos."
                ],
      "vegano": false,
      "tipo": "Doces",
      "culinária": ["Brasileira"],
      "tempoDePreparo": "120 minutos",
      "rendimento": "3 porções",
      "acessos": 4,
      "destaque": false
    }
    
  ],
  "categorias": [
    {
      "id": 1,
      "nome": "Massas"
    },
    {
      "id": 2,
      "nome": "Sobremesas"
    },    
    {
      "id": 3,
      "nome": "Carnes"
    },
    {
      "id": 4,
      "nome": "Carnes suína"
    },
    {
      "id": 5,
      "nome": "Frutos do mar"
    },
    {
      "id": 6,
      "nome": "Aves"
    },
    {
      "id": 7,
      "nome": "Lanches"
    }
  ],
  "favoritos":[
    {
      "nome": "favorito 1",
      "id": 1
    },
    {
      "nome": "favorito 2",
      "id": 2
    },
    {
      "nome": "favorito 3",
      "id": 4
    }
  ]
}
